using System.ComponentModel;

namespace IST.Shared.Enums;

public enum ResponseStatusCode
{
    //=================================================
    // 1000+: Успешные операции (Success)
    //=================================================

    /// <summary>
    /// Операция успешно выполнена.
    /// </summary>
    [Description("Операция успешно выполнена.")]
    Ok = 1000,

    /// <summary>
    /// Ресурс успешно создан.
    /// </summary>
    [Description("Ресурс успешно создан.")]
    Created, // 1001


    //=================================================
    // 4000+: Ошибки на стороне клиента (Client Errors)
    //=================================================

    /// <summary>
    /// Запрос не может быть обработан.
    /// </summary>
    [Description("Запрос не может быть обработан.")]
    BadRequest = 4000,

    /// <summary>
    /// Ошибка валидации данных.
    /// </summary>
    [Description("Ошибка валидации данных.")]
    ValidationError, // 4001

    /// <summary>
    /// Пользователь не аутентифицирован.
    /// </summary>
    [Description("Пользователь не аутентифицирован.")]
    Unauthorized, // 4002

    /// <summary>
    /// У пользователя нет прав.
    /// </summary>
    [Description("У пользователя нет прав.")]
    Forbidden, // 4003

    /// <summary>
    /// Срок действия пароля пользователя истек.
    /// </summary>
    [Description("Срок действия пароля пользователя истек.")]
    PasswordExpired, // 4004

    /// <summary>
    /// Запрашиваемый ресурс не найден.
    /// </summary>
    [Description("Запрашиваемый ресурс не найден.")]
    NotFound, // 4005

    /// <summary>
    /// Конфликт: ресурс уже существует.
    /// </summary>
    [Description("Конфликт: ресурс уже существует.")]
    Conflict, // 4006


    //=================================================
    // 5000+: Ошибки на стороне сервера (Server Errors)
    //=================================================

    /// <summary>
    /// Внутренняя ошибка сервера.
    /// </summary>
    [Description("Внутренняя ошибка сервера.")]
    InternalServerError = 5000,

    /// <summary>
    /// Ошибка базы данных.
    /// </summary>
    [Description("Ошибка базы данных.")]
    DatabaseError, // 5001

    /// <summary>
    /// Сервис временно недоступен.
    /// </summary>
    [Description("Сервис временно недоступен.")]
    ServiceUnavailable // 5002
}